{
  "DateTime": "2018-11-15T23:38:39.5334324Z",
  "Definition": {
    "Id": "4222654",
    "Title": "Why I Bought More Apple Stock Wednesday",
    "Date": "2018-11-15T22:33:09Z",
    "Topic": "Article",
    "Url": "https://seekingalpha.com/article/4222654",
    "Feed": {
      "Category": "AAPL",
      "Url": "https://seekingalpha.com/api/sa/combined/AAPL.xml"
    },
    "Element": {
      "item": {
        "title": "Why I Bought More Apple Stock Wednesday",
        "link": "https://seekingalpha.com/article/4222654-bought-apple-stock-wednesday?source=feed_symbol_AAPL",
        "guid": {
          "@isPermaLink": "false",
          "#text": "https://seekingalpha.com/Article:4222654"
        },
        "pubDate": "Thu, 15 Nov 2018 17:33:09 -0500",
        "sa:author_name": "Sean Chandler",
        "media:thumbnail": {
          "@url": ""
        },
        "sa:picture": null,
        "sa:stock": {
          "sa:symbol": "AAPL",
          "sa:company_name": "Apple Inc."
        }
      }
    }
  },
  "Comments": [
    {
      "Id": "80236637",
      "Author": "tdanzig",
      "AuthorId": "966900",
      "IsSpecialAuthor": false,
      "Text": "Bought some calls.  Join the club. :)",
      "Date": "2018-11-15T22:38:12+00:00",
      "Vote": 1.0
    },
    {
      "Id": "80236687",
      "Author": "AceVentura",
      "AuthorId": "13244842",
      "IsSpecialAuthor": false,
      "Text": "I am fully invested but rolled some calls.  How much does Apple have left in its repurchase authorization? About $80 billion?",
      "Date": "2018-11-15T22:42:17+00:00",
      "Vote": 1.0
    },
    {
      "Id": "80236699",
      "Author": "rsucre",
      "AuthorId": "20475031",
      "IsSpecialAuthor": false,
      "Text": "I added more AAPL yesterday. Too overweight AAPL now but it has always delivered. Long since 2009.",
      "Date": "2018-11-15T22:43:08+00:00",
      "Vote": 4.0
    },
    {
      "Id": "80236718",
      "Author": "Thomas40",
      "AuthorId": "376779",
      "IsSpecialAuthor": false,
      "Text": "I couldn't agree more.  While I missed the bottom yesterday I did add last week at 202 having added at 176 and 151 in the last 24 months.  This seems to happen every quarter as the nervous nellies and the pathetic analysts issue their doom and gloom prognostications.  It just doesn't seem to work out like they say and those of us who are LTBH investors make out just fine.  I'm surprised that so many of the analysts stay employed with all their wrong calls.  I get more solid insight from the contributors and the other posters here at SA than any analyst I can think of.",
      "Date": "2018-11-15T22:44:24+00:00",
      "Vote": 6.0
    },
    {
      "Id": "80236954",
      "Author": "Silli-Con Doc",
      "AuthorId": "17940962",
      "IsSpecialAuthor": false,
      "Text": "@Thomas40“Pathetic analysts” are panicking pundits promoting public perceptions of perilous pronouncements for their personal profit.",
      "Date": "2018-11-15T23:08:10+00:00",
      "Vote": 1.0
    },
    {
      "Id": "80236727",
      "Author": "ljdfour",
      "AuthorId": "13374682",
      "IsSpecialAuthor": false,
      "Text": "Added @ $189. Long since 2011.",
      "Date": "2018-11-15T22:45:14+00:00",
      "Vote": 4.0
    },
    {
      "Id": "80236733",
      "Author": "ljdfour",
      "AuthorId": "13374682",
      "IsSpecialAuthor": false,
      "Text": "Added more @ $189. Long since 2011.",
      "Date": "2018-11-15T22:46:20+00:00",
      "Vote": 2.0
    },
    {
      "Id": "80236757",
      "Author": "Bald Eagles58",
      "AuthorId": "601224",
      "IsSpecialAuthor": false,
      "Text": "Apple products are great products with a sophisticated clientele. I’ll never sell AAPL, but I do keep a large AAPL reserve of cash to buy more of its common stock on its way down. I’m an investor and not a day or week or month or annual trader. I’m very long AAPL.",
      "Date": "2018-11-15T22:48:27+00:00",
      "Vote": 5.0
    },
    {
      "Id": "80236762",
      "Author": "JasonMiles",
      "AuthorId": "784904",
      "IsSpecialAuthor": false,
      "Text": "I have owned Apple stock for 13 years now. After the split I really had a bunch of chairs that I have just not touched it and don’t plan on for a few years. . My target price is close to $300 before I cash out..It may not happen soon but hopefully within the next five years it will. They are the only companies that I truly have faith in that can pull it off",
      "Date": "2018-11-15T22:48:43+00:00",
      "Vote": 6.0
    },
    {
      "Id": "80236856",
      "Author": "ispank",
      "AuthorId": "12116901",
      "IsSpecialAuthor": false,
      "Text": "I am with you set eyes on $300 price targets precisely, no more, no less. 🍎🍎🍎🇺🇸🇺🇸🇺🇸👍👍👍",
      "Date": "2018-11-15T22:57:40+00:00",
      "Vote": 2.0
    },
    {
      "Id": "80236851",
      "Author": "rockjcp",
      "AuthorId": "49800470",
      "IsSpecialAuthor": false,
      "Text": "Apple price says iPhone sales fall 40% and Services don't grow more than 5%. Also add in stock buybacks terminated and a dividend cut. Reality says fair value @240 and that's Conservative!",
      "Date": "2018-11-15T22:57:15+00:00",
      "Vote": 3.0
    },
    {
      "Id": "80236863",
      "Author": "daveylove",
      "AuthorId": "781941",
      "IsSpecialAuthor": false,
      "Text": "short 190 parts will probably roll them down to 185 if they go in the money for a small credit",
      "Date": "2018-11-15T22:58:44+00:00",
      "Vote": 1.0
    },
    {
      "Id": "80236865",
      "Author": "ghobud",
      "AuthorId": "19498641",
      "IsSpecialAuthor": false,
      "Text": "Ya, everyone here bought some apple yesterday !!!Tomorrow after it closes down , everyone did sell it today 🤔",
      "Date": "2018-11-15T22:58:49+00:00",
      "Vote": 0.0
    },
    {
      "Id": "80236979",
      "Author": "JReacher",
      "AuthorId": "13221692",
      "IsSpecialAuthor": false,
      "Text": "Nope. Will buy some more.",
      "Date": "2018-11-15T23:10:25+00:00",
      "Vote": 1.0
    },
    {
      "Id": "80236874",
      "Author": "heafod",
      "AuthorId": "720139",
      "IsSpecialAuthor": false,
      "Text": "Toped off way overweight   Added 25 @ 89.1 too! Couldn't resist",
      "Date": "2018-11-15T23:00:07+00:00",
      "Vote": 0.0
    },
    {
      "Id": "80236879",
      "Author": "daveylove",
      "AuthorId": "781941",
      "IsSpecialAuthor": false,
      "Text": "that's puts not parts",
      "Date": "2018-11-15T23:00:32+00:00",
      "Vote": 0.0
    },
    {
      "Id": "80236885",
      "Author": "Ratatattatt",
      "AuthorId": "49460350",
      "IsSpecialAuthor": false,
      "Text": "This is exactly word my argument today with a friend. Can you please provide some insight on how buybacks work",
      "Date": "2018-11-15T23:01:31+00:00",
      "Vote": 0.0
    },
    {
      "Id": "80237011",
      "Author": "Lawrence J. Furman",
      "AuthorId": "980941",
      "IsSpecialAuthor": false,
      "Text": "If Apple announced the replacement of the Intel processors with Apple Bionic chips, which I imagine would cut costs and increase margins, the analysts would announce that because Intel, a supplier, will be negatively impacted the value of Apple will drop.",
      "Date": "2018-11-15T23:13:16+00:00",
      "Vote": 1.0
    },
    {
      "Id": "80237092",
      "Author": "cjjohnson",
      "AuthorId": "31293285",
      "IsSpecialAuthor": false,
      "Text": "I added when it sunk to around $202. Then added again around $197. This stock feels cheap again like it is 2014.",
      "Date": "2018-11-15T23:21:49+00:00",
      "Vote": 0.0
    },
    {
      "Id": "80237126",
      "Author": "giofls",
      "AuthorId": "24382853",
      "IsSpecialAuthor": false,
      "Text": "The short-term technicals made buying at these levels a seeming no-brainer.  200dma at about $193, and recent history is that AAPL ducks a few $s below that and rockets ahead to new highs.Bought at $191 and added at $187.  Good value and with the technicals at my back.What could possibly go wrong....   hmmmm....  let's not think about that  :)",
      "Date": "2018-11-15T23:25:25+00:00",
      "Vote": 0.0
    },
    {
      "Id": "80237161",
      "Author": "Imby",
      "AuthorId": "808714",
      "IsSpecialAuthor": false,
      "Text": "I LOVE my new Iphone! I thought it would fly off the shelves. Best yet! It flies!",
      "Date": "2018-11-15T23:29:02+00:00",
      "Vote": 0.0
    },
    {
      "Id": "80237194",
      "Author": "bdrink",
      "AuthorId": "37566606",
      "IsSpecialAuthor": false,
      "Text": "Congrats to all AAPL shareholders.  Today was dividend payout day, so everyone should be happy until tomorrow's trading sessions begin.",
      "Date": "2018-11-15T23:32:37+00:00",
      "Vote": 0.0
    }
  ],
  "ArticleText": {
    "Title": "Why I Bought More Apple Stock Wednesday",
    "Text": "Here we go again. On Monday, one of Apple’s (AAPL) facial recognition suppliers, Lumentum (NASDAQ:LITE), lowered its projections blaming reduced orders from a big customer. In addition, JP Morgan, Longbow Research, and analyst Ming Chi Kuo all see cuts in iPhone XR shipments with each having mixed opinions on whether iPhone XS or iPhone 8 will offset any declines. Monday wasn’t a great day for Apple after falling a whopping 5%. On Tuesday, Goldman Sachs downgraded Apple to $209 based on lower iPhone XR shipment expectations in favor of more affordable iPhones. Apple closed 1% lower to $192 on Tuesday, and as of writing this Wednesday, Apple is trading at $186 per share. That's lower than where it was trading in July prior to the earnings report that pushed Apple to its all-time high of $233. Apple’s stock is down more than 15% since its earnings report this month, indicating that investors believe it's in trouble. That's worse than Amazon (NASDAQ:AMZN), whose stock is down just 9% following a disappointing guidance. If by chance Amazon disappoints over the holiday, its shares will collapse dramatically. If Apple disappoints, it will still be one of the most profitable companies on the market. The selloff has been fueled by analysts who have downgraded the stock but still have price targets 10-15% higher than its existing price target. I'm buying this deep all week long. Tim Cook and Warren Buffet may as well be too, and considering Apple repurchased over $19.4B at an average price of $221 there is a high probability that it is, too. Investor fear with Apple is an event that happens all too often, with the most recent being in Spring where Taiwan Semiconductor (TSM) reported poor earnings blaming a “high-end smartphone”, assumed to be iPhone X. Morgan Stanley followed up with a downgrade, trimming its iPhone unit shipments to 34M and revenue to $46B. Apple’s stock fell roughly 8% in two days. I followed up with the report with an article titled “Why I bought more Apple Stock on Friday”. A little later, Apple showed investors that it was business as usual: it sold 41.3 million iPhones and posted revenues of $53.3B in July. Morgan Stanley was off by more than 21% on iPhone shipments and more than 15% in revenue. At least going forward, without Apple's reporting of units, revenue is the only thing analysts can get right or wrong. To give analysts the benefit of the doubt, maybe this time is different. Earlier this month, Apple reported its earnings and beat analyst expectations in revenue, EPS, and iPhone ASP but disappointed on unit sales and guidance (info on that below). While this wasn't the great news analysts were expecting, the fear has pulled Apple's shares back into what's a very attractive valuation. At the moment's price of $186 and a twelve-month EPS of $11.87, Apple’s PE ratio is 15.75; when you subtract cash, the PE is 11.6, add debt and it's 13.7. Considering how Apple compares to a list of companies below, it is extremely cheap. I don’t see Apple’s profitability at risk, nor do I see iPhone revenue collapsing, and with the growth of Services and Wearables, Apple is attractive for the long run. AAPL PE Ratio (TTM) data by YCharts As a quick review to earnings, I've made two charts with actual results versus analyst expectations: Actual Revenue (beat) $62.9B $61.6B EPS (beat) $2.91 $2.78 iPhone Unit Sales (miss) 46.9M 47.5M ASP (beat) $793 $751 Guidance (miss) $89B-$93B $92.9B And here are some other points of interest in Apple's business: Current Quarter Year Ago Quarter Year Ago % Change Gross Margin 38.3% 37.9% 1% iPhone Revenue $ 37,185M $28,846 29% iPhone Unit Sales 46,889M 46,677 million 0.4% iPad Revenue $ 4,089M $ 4,831M -15% iPad Units 9,699M 10,326M -6% Mac Revenue $ 7,411M $ 7,170M 3% Mac Unit Sales 5,299M 5,386M -2% Services $ 9,981M $ 8,501M 17% ** Other $ 4,234M $3,231 31% Greater China $11,411 $ 9,801M 16% **Apple says excluding a one-time benefit from the year ago quarter, revenue would be up 27%. As shown in the charts above, the winners were iPhone, Services, and Other Products revenues with the laggard being iPhone units, guidance, and iPad. The quarter wasn't a disaster by any means, and I kind of wonder how Apple would have performed if it beat on every metric that it had, but fell in line with iPhone shipments and ASPs. Based on analysts' estimates, when you add the expected units and ASP, analysts were expecting iPhone revenue to be $37.19B, which is exactly where it was. This is basic economics; when you raise the price of a product, demand falls. Perhaps Apple was a little too ambitious with the pricing of its iPhone, but given that iPhone XS Max costs $390 to produce and retails for $1,100, which is a 65% profit margin before other costs, there is plenty of room for improvement. Given the 65% profit margin and the estimated $120 cost of the Samsung (OTC:SSNLF) OLED display, Apple is effectively charging customers $350 for an OLED display. Before Apple decided to go with Samsung's OLED display, Apple was estimated to be paying no more than $42 for its iPhone Plus models using an OLED display. Apple is undoubtedly and reportedly working on developing its own OLED displays without relying on the steep markup of its competitor, Samsung. If Apple can reduce costs of the OLED display by a reasonable $40, it could cut the cost of iPhone XS and XS Max by $100 and still improve margins. In October, when the fear of tariffs, rising interest rates and slowing economic growth pulled the DJIA and S&amp;P 500 back 9% as well as the NASDAQ over 12%, Apple resisted falling less than 3%. After a number of reports and analyst downgrades, the selloff of Apple stock has outpaced the DJIA by more than two times. There is nothing wrong with Apple's business, and vertical integration of its iPhone XS display would be a huge breakthrough. At its current levels, it trades at a PE ratio of less than 16. Before the earnings report, the PE ratio was well above 21. Seeing that revenue guidance for the upcoming quarter is suggesting a smaller than expected 1-5% year-over-year growth versus the double-digit growth we've seen over the last few quarters, a small selloff was understandable. A more than 15% selloff is a bit exaggerated, and I would not be surprised to see a knee-jerk reaction in the coming days and weeks. It's not often that Apple comes at such a discount, so I would not be surprised to see Apple accelerate its repurchases, and as for me, I'm buying this dip. Disclosure: I am/we are long AAPL. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. "
  }
}